run/navalFoamVariant2/waveTank/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (0 -40 0)
    (320 -40 0)
    (320 -6 0)
    (0 -6 0)
    (320 3 0)
    (0 3 0)
    (320 15 0)
    (0 15 0)

    (0 -40 1)
    (320 -40 1)
    (320 -6 1)
    (0 -6 1)
    (320 3 1)
    (0 3 1)
    (320 15 1)
    (0 15 1)
);


blocks
(
    hex (0 1 2 3 8 9 10 11) (250 40 1) simpleGrading (1 0.25 1)
    hex (3 2 4 5 11 10 12 13) (250 30 1) simpleGrading (1 1 1)
    hex (5 4 6 7 13 12 14 15) (250 25 1) simpleGrading (1 3 1)
);

edges
(
);

patches
(
    patch left
    (
        (0 8 11 3)
        (3 11 13 5)
        (5 13 15 7)
    )

    patch right
    (
        (1 9 10 2)
        (2 10 12 4)
        (4 12 14 6)
    )

    patch bottom
    (
        (0 1 9 8)
    )

    patch top
    (
        (7 6 14 15)
    )

    empty frontAndBack
    (
        // Back
        (8 9 10 11)
        (11 10 12 13)
        (13 12 14 15)

        // Front
        (0 1 2 3)
        (3 2 4 5)
        (5 4 6 7)
    )
);

mergePatchPairs
();


// ************************************************************************* //
