run/navalFoamVariant2/waveTank/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            linearWaveVelocity;
        amplitude       2.5;
        period          10;
        valueAbove      (0 0 0);
        value           $internalField;
    }

    right
    {
        type            numericalBeach;
        inletValue      uniform (0 0 0);
        nud             6;
        offset          10;
        thickness       40;
        value           $internalField;
    }

    bottom
    {
        type            slip;
    }

    top
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        rho             rho;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
