run/navalFoamVariant2/waveTank/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pd
    {
        solver            amgSolver;
        cycle             W-cycle;
        policy            AAMG;
        nPreSweeps        0;
        nPostSweeps       2;
        groupSize         4;
        minCoarseEqns     20;
        nMaxLevels        100;
        scale             on;
        smoother          ILU;

        minIter           0;
        maxIter           200;
        tolerance         1e-7;
        relTol            0.01;
    };

    pdFinal
    {
        solver            amgSolver;
        cycle             W-cycle;
        policy            AAMG;
        nPreSweeps        0;
        nPostSweeps       2;
        groupSize         4;
        minCoarseEqns     20;
        nMaxLevels        100;
        scale             on;
        smoother          ILU;

        minIter           0;
        maxIter           200;
        tolerance         1e-9;
        relTol            0.0;
    };

    alpha1
    {
        solver            BiCGStab;
        preconditioner    Cholesky;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.0;
    };

    U
    {
        solver            BiCGStab;
        preconditioner    Cholesky;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.01;
    };
}

PISO
{
    cAlpha          1;
}


PIMPLE
{
    pRefPoint       (300 12 0.5);
    pRefValue       0.0;

    nCorrectors        6;
    nOuterCorrectors   1;
    nNonOrthogonalCorrectors 0;

    nAlphaSubCycles 0;

    singlePhase     no;
    implicitAlpha   on;
    implicitP       off;

    correctPhi      off;
    checkMeshCourantNo  off;

    limitMagU       20;
    startMotionTime 0;
}


relaxationFactors
{
    U          1;
    pd         1;

    p          1;
}


// ************************************************************************* //
